MikroElektronika/core_packages/PIC/XC8/def/PIC18F8680/mcu.h
// Register: B5DLC
#define B5DLC B5DLC
extern volatile unsigned char           B5DLC               __at(0xE75);
#ifndef _LIB_BUILD
asm("B5DLC equ 0E75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESRB0                 :1;
        unsigned RESRB1                 :1;
    };
    struct {
        unsigned B5DLC0                 :1;
        unsigned B5DLC1                 :1;
        unsigned B5DLC2                 :1;
        unsigned B5DLC3                 :1;
        unsigned B5RB0                  :1;
        unsigned B5RB1                  :1;
        unsigned B5RXRTR                :1;
    };
} B5DLCbits_t;
extern volatile B5DLCbits_t B5DLCbits __at(0xE75);
// bitfield macros
#define _B5DLC_DLC0_POSN                                    0x0
#define _B5DLC_DLC0_POSITION                                0x0
#define _B5DLC_DLC0_SIZE                                    0x1
#define _B5DLC_DLC0_LENGTH                                  0x1
#define _B5DLC_DLC0_MASK                                    0x1
#define _B5DLC_DLC1_POSN                                    0x1
#define _B5DLC_DLC1_POSITION                                0x1
#define _B5DLC_DLC1_SIZE                                    0x1
#define _B5DLC_DLC1_LENGTH                                  0x1
#define _B5DLC_DLC1_MASK                                    0x2
#define _B5DLC_DLC2_POSN                                    0x2
#define _B5DLC_DLC2_POSITION                                0x2
#define _B5DLC_DLC2_SIZE                                    0x1
#define _B5DLC_DLC2_LENGTH                                  0x1
#define _B5DLC_DLC2_MASK                                    0x4
#define _B5DLC_DLC3_POSN                                    0x3
#define _B5DLC_DLC3_POSITION                                0x3
#define _B5DLC_DLC3_SIZE                                    0x1
#define _B5DLC_DLC3_LENGTH                                  0x1
#define _B5DLC_DLC3_MASK                                    0x8
#define _B5DLC_RB0_POSN                                     0x4
#define _B5DLC_RB0_POSITION                                 0x4
#define _B5DLC_RB0_SIZE                                     0x1
#define _B5DLC_RB0_LENGTH                                   0x1
#define _B5DLC_RB0_MASK                                     0x10
#define _B5DLC_RB1_POSN                                     0x5
#define _B5DLC_RB1_POSITION                                 0x5
#define _B5DLC_RB1_SIZE                                     0x1
#define _B5DLC_RB1_LENGTH                                   0x1
#define _B5DLC_RB1_MASK                                     0x20
#define _B5DLC_RXRTR_POSN                                   0x6
#define _B5DLC_RXRTR_POSITION                               0x6
#define _B5DLC_RXRTR_SIZE                                   0x1
#define _B5DLC_RXRTR_LENGTH                                 0x1
#define _B5DLC_RXRTR_MASK                                   0x40
#define _B5DLC_RESRB0_POSN                                  0x4
#define _B5DLC_RESRB0_POSITION                              0x4
#define _B5DLC_RESRB0_SIZE                                  0x1
#define _B5DLC_RESRB0_LENGTH                                0x1
#define _B5DLC_RESRB0_MASK                                  0x10
#define _B5DLC_RESRB1_POSN                                  0x5
#define _B5DLC_RESRB1_POSITION                              0x5
#define _B5DLC_RESRB1_SIZE                                  0x1
#define _B5DLC_RESRB1_LENGTH                                0x1
#define _B5DLC_RESRB1_MASK                                  0x20
#define _B5DLC_B5DLC0_POSN                                  0x0
#define _B5DLC_B5DLC0_POSITION                              0x0
#define _B5DLC_B5DLC0_SIZE                                  0x1
#define _B5DLC_B5DLC0_LENGTH                                0x1
#define _B5DLC_B5DLC0_MASK                                  0x1
#define _B5DLC_B5DLC1_POSN                                  0x1
#define _B5DLC_B5DLC1_POSITION                              0x1
#define _B5DLC_B5DLC1_SIZE                                  0x1
#define _B5DLC_B5DLC1_LENGTH                                0x1
#define _B5DLC_B5DLC1_MASK                                  0x2
#define _B5DLC_B5DLC2_POSN                                  0x2
#define _B5DLC_B5DLC2_POSITION                              0x2
#define _B5DLC_B5DLC2_SIZE                                  0x1
#define _B5DLC_B5DLC2_LENGTH                                0x1
#define _B5DLC_B5DLC2_MASK                                  0x4
#define _B5DLC_B5DLC3_POSN                                  0x3
#define _B5DLC_B5DLC3_POSITION                              0x3
#define _B5DLC_B5DLC3_SIZE                                  0x1
#define _B5DLC_B5DLC3_LENGTH                                0x1
#define _B5DLC_B5DLC3_MASK                                  0x8
#define _B5DLC_B5RB0_POSN                                   0x4
#define _B5DLC_B5RB0_POSITION                               0x4
#define _B5DLC_B5RB0_SIZE                                   0x1
#define _B5DLC_B5RB0_LENGTH                                 0x1
#define _B5DLC_B5RB0_MASK                                   0x10
#define _B5DLC_B5RB1_POSN                                   0x5
#define _B5DLC_B5RB1_POSITION                               0x5
#define _B5DLC_B5RB1_SIZE                                   0x1
#define _B5DLC_B5RB1_LENGTH                                 0x1
#define _B5DLC_B5RB1_MASK                                   0x20
#define _B5DLC_B5RXRTR_POSN                                 0x6
#define _B5DLC_B5RXRTR_POSITION                             0x6
#define _B5DLC_B5RXRTR_SIZE                                 0x1
#define _B5DLC_B5RXRTR_LENGTH                               0x1
#define _B5DLC_B5RXRTR_MASK                                 0x40

