MikroElektronika/core_packages/PIC/XC8/def/PIC18F8680/mcu.h
// Register: PCL
#define PCL PCL
extern volatile unsigned char           PCL                 __at(0xFF9);
#ifndef _LIB_BUILD
asm("PCL equ 0FF9h");
#endif

// Register: PCLATH
#define PCLATH PCLATH
extern volatile unsigned char           PCLATH              __at(0xFFA);
#ifndef _LIB_BUILD
asm("PCLATH equ 0FFAh");
#endif

// Register: PCLATU
#define PCLATU PCLATU
extern volatile unsigned char           PCLATU              __at(0xFFB);
#ifndef _LIB_BUILD
asm("PCLATU equ 0FFBh");
#endif

// Register: STKPTR
#define STKPTR STKPTR
extern volatile unsigned char           STKPTR              __at(0xFFC);
#ifndef _LIB_BUILD
asm("STKPTR equ 0FFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STKPTR                 :5;
        unsigned                        :1;
        unsigned STKUNF                 :1;
        unsigned STKFUL                 :1;
    };
    struct {
        unsigned STKPTR0                :1;
        unsigned STKPTR1                :1;
        unsigned STKPTR2                :1;
        unsigned STKPTR3                :1;
        unsigned STKPTR4                :1;
        unsigned                        :2;
        unsigned STKOVF                 :1;
    };
} STKPTRbits_t;
extern volatile STKPTRbits_t STKPTRbits __at(0xFFC);
// bitfield macros
#define _STKPTR_STKPTR_POSN                                 0x0
#define _STKPTR_STKPTR_POSITION                             0x0
#define _STKPTR_STKPTR_SIZE                                 0x5
#define _STKPTR_STKPTR_LENGTH                               0x5
#define _STKPTR_STKPTR_MASK                                 0x1F
#define _STKPTR_STKUNF_POSN                                 0x6
#define _STKPTR_STKUNF_POSITION                             0x6
#define _STKPTR_STKUNF_SIZE                                 0x1
#define _STKPTR_STKUNF_LENGTH                               0x1
#define _STKPTR_STKUNF_MASK                                 0x40
#define _STKPTR_STKFUL_POSN                                 0x7
#define _STKPTR_STKFUL_POSITION                             0x7
#define _STKPTR_STKFUL_SIZE                                 0x1
#define _STKPTR_STKFUL_LENGTH                               0x1
#define _STKPTR_STKFUL_MASK                                 0x80
#define _STKPTR_STKPTR0_POSN                                0x0
#define _STKPTR_STKPTR0_POSITION                            0x0
#define _STKPTR_STKPTR0_SIZE                                0x1
#define _STKPTR_STKPTR0_LENGTH                              0x1
#define _STKPTR_STKPTR0_MASK                                0x1
#define _STKPTR_STKPTR1_POSN                                0x1
#define _STKPTR_STKPTR1_POSITION                            0x1
#define _STKPTR_STKPTR1_SIZE                                0x1
#define _STKPTR_STKPTR1_LENGTH                              0x1
#define _STKPTR_STKPTR1_MASK                                0x2
#define _STKPTR_STKPTR2_POSN                                0x2
#define _STKPTR_STKPTR2_POSITION                            0x2
#define _STKPTR_STKPTR2_SIZE                                0x1
#define _STKPTR_STKPTR2_LENGTH                              0x1
#define _STKPTR_STKPTR2_MASK                                0x4
#define _STKPTR_STKPTR3_POSN                                0x3
#define _STKPTR_STKPTR3_POSITION                            0x3
#define _STKPTR_STKPTR3_SIZE                                0x1
#define _STKPTR_STKPTR3_LENGTH                              0x1
#define _STKPTR_STKPTR3_MASK                                0x8
#define _STKPTR_STKPTR4_POSN                                0x4
#define _STKPTR_STKPTR4_POSITION                            0x4
#define _STKPTR_STKPTR4_SIZE                                0x1
#define _STKPTR_STKPTR4_LENGTH                              0x1
#define _STKPTR_STKPTR4_MASK                                0x10
#define _STKPTR_STKOVF_POSN                                 0x7
#define _STKPTR_STKOVF_POSITION                             0x7
#define _STKPTR_STKOVF_SIZE                                 0x1
#define _STKPTR_STKOVF_LENGTH                               0x1
#define _STKPTR_STKOVF_MASK                                 0x80

// Register: TOS
#define TOS TOS
#ifndef __CCI__
extern volatile __uint24                TOS                 __at(0xFFD);
#endif
#ifndef _LIB_BUILD
asm("TOS equ 0FFDh");
#endif

// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON<ABDEN>
extern volatile __bit                   ABDEN               __at(0x7BF0);	// @ (0xF7E * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUDCON,0)
// SSPCON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSPCON2,5)
// SSPCON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSPCON2,4)
// SSPCON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSPCON2,6)
// ADCON2<ACQT0>
extern volatile __bit                   ACQT0               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 ACQT0_bit           _BIT_ACCESS(ADCON2,3)
// ADCON2<ACQT1>
extern volatile __bit                   ACQT1               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 ACQT1_bit           _BIT_ACCESS(ADCON2,4)
// ADCON2<ACQT2>
extern volatile __bit                   ACQT2               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 ACQT2_bit           _BIT_ACCESS(ADCON2,5)
// PORTD<AD0>
extern volatile __bit                   AD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 AD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<AD1>
extern volatile __bit                   AD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 AD1_bit             _BIT_ACCESS(PORTD,1)
// PORTE<AD10>
extern volatile __bit                   AD10                __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 AD10_bit            _BIT_ACCESS(PORTE,2)
// PORTE<AD11>
extern volatile __bit                   AD11                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 AD11_bit            _BIT_ACCESS(PORTE,3)
// PORTE<AD12>
extern volatile __bit                   AD12                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 AD12_bit            _BIT_ACCESS(PORTE,4)
// PORTE<AD13>
extern volatile __bit                   AD13                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 AD13_bit            _BIT_ACCESS(PORTE,5)
// PORTE<AD14>
extern volatile __bit                   AD14                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 AD14_bit            _BIT_ACCESS(PORTE,6)
// PORTE<AD15>
extern volatile __bit                   AD15                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 AD15_bit            _BIT_ACCESS(PORTE,7)
// PORTH<AD16>
extern volatile __bit                   AD16                __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 AD16_bit            _BIT_ACCESS(PORTH,0)
// PORTH<AD17>
extern volatile __bit                   AD17                __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 AD17_bit            _BIT_ACCESS(PORTH,1)
// PORTH<AD18>
extern volatile __bit                   AD18                __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 AD18_bit            _BIT_ACCESS(PORTH,2)
// PORTH<AD19>
extern volatile __bit                   AD19                __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 AD19_bit            _BIT_ACCESS(PORTH,3)
// PORTD<AD2>
extern volatile __bit                   AD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 AD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<AD3>
extern volatile __bit                   AD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 AD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<AD4>
extern volatile __bit                   AD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 AD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<AD5>
extern volatile __bit                   AD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 AD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<AD6>
extern volatile __bit                   AD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 AD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<AD7>
extern volatile __bit                   AD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 AD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<AD8>
extern volatile __bit                   AD8                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 AD8_bit             _BIT_ACCESS(PORTE,0)
// PORTE<AD9>
extern volatile __bit                   AD9                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 AD9_bit             _BIT_ACCESS(PORTE,1)
// ADCON2<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON2,2)
// RCSTA<ADDEN>
extern volatile __bit                   ADDEN               __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA,3)
// RCSTA<ADDEN1>
extern volatile __bit                   ADDEN1              __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN1_bit          _BIT_ACCESS(RCSTA,3)
// RCSTA<ADEN>
extern volatile __bit                   ADEN                __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADEN_bit            _BIT_ACCESS(RCSTA,3)
// ADCON2<ADFM>
extern volatile __bit                   ADFM                __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON2,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// PORTJ<ALE>
extern volatile __bit                   ALE                 __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 ALE_bit             _BIT_ACCESS(PORTJ,0)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTF<AN10>
extern volatile __bit                   AN10                __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 AN10_bit            _BIT_ACCESS(PORTF,5)
// PORTF<AN11>
extern volatile __bit                   AN11                __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 AN11_bit            _BIT_ACCESS(PORTF,6)
// PORTH<AN12>
extern volatile __bit                   AN12                __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 AN12_bit            _BIT_ACCESS(PORTH,4)
// PORTH<AN13>
extern volatile __bit                   AN13                __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 AN13_bit            _BIT_ACCESS(PORTH,5)
// PORTH<AN14>
extern volatile __bit                   AN14                __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 AN14_bit            _BIT_ACCESS(PORTH,6)
// PORTH<AN15>
extern volatile __bit                   AN15                __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 AN15_bit            _BIT_ACCESS(PORTH,7)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,5)
// PORTF<AN5>
extern volatile __bit                   AN5                 __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 AN5_bit             _BIT_ACCESS(PORTF,0)
// PORTF<AN6>
extern volatile __bit                   AN6                 __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 AN6_bit             _BIT_ACCESS(PORTF,1)
// PORTF<AN7>
extern volatile __bit                   AN7                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 AN7_bit             _BIT_ACCESS(PORTF,2)
// PORTF<AN8>
extern volatile __bit                   AN8                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 AN8_bit             _BIT_ACCESS(PORTF,3)
// PORTF<AN9>
extern volatile __bit                   AN9                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 AN9_bit             _BIT_ACCESS(PORTF,4)
// B0D0<B0D00>
extern volatile __bit                   B0D00               __at(0x7130);	// @ (0xE26 * 8 + 0)
#define                                 B0D00_bit           _BIT_ACCESS(B0D0,0)
// B0D0<B0D01>
extern volatile __bit                   B0D01               __at(0x7131);	// @ (0xE26 * 8 + 1)
#define                                 B0D01_bit           _BIT_ACCESS(B0D0,1)
// B0D0<B0D02>
extern volatile __bit                   B0D02               __at(0x7132);	// @ (0xE26 * 8 + 2)
#define                                 B0D02_bit           _BIT_ACCESS(B0D0,2)
// B0D0<B0D03>
extern volatile __bit                   B0D03               __at(0x7133);	// @ (0xE26 * 8 + 3)
#define                                 B0D03_bit           _BIT_ACCESS(B0D0,3)
// B0D0<B0D04>
extern volatile __bit                   B0D04               __at(0x7134);	// @ (0xE26 * 8 + 4)
#define                                 B0D04_bit           _BIT_ACCESS(B0D0,4)
// B0D0<B0D05>
extern volatile __bit                   B0D05               __at(0x7135);	// @ (0xE26 * 8 + 5)
#define                                 B0D05_bit           _BIT_ACCESS(B0D0,5)
// B0D0<B0D06>
extern volatile __bit                   B0D06               __at(0x7136);	// @ (0xE26 * 8 + 6)
#define                                 B0D06_bit           _BIT_ACCESS(B0D0,6)
// B0D0<B0D07>
extern volatile __bit                   B0D07               __at(0x7137);	// @ (0xE26 * 8 + 7)
#define                                 B0D07_bit           _BIT_ACCESS(B0D0,7)
// B0D1<B0D10>
extern volatile __bit                   B0D10               __at(0x7138);	// @ (0xE27 * 8 + 0)
#define                                 B0D10_bit           _BIT_ACCESS(B0D1,0)
// B0D1<B0D11>
extern volatile __bit                   B0D11               __at(0x7139);	// @ (0xE27 * 8 + 1)
#define                                 B0D11_bit           _BIT_ACCESS(B0D1,1)
// B0D1<B0D12>
extern volatile __bit                   B0D12               __at(0x713A);	// @ (0xE27 * 8 + 2)
#define                                 B0D12_bit           _BIT_ACCESS(B0D1,2)
// B0D1<B0D13>
extern volatile __bit                   B0D13               __at(0x713B);	// @ (0xE27 * 8 + 3)
#define                                 B0D13_bit           _BIT_ACCESS(B0D1,3)
// B0D1<B0D14>
extern volatile __bit                   B0D14               __at(0x713C);	// @ (0xE27 * 8 + 4)
#define                                 B0D14_bit           _BIT_ACCESS(B0D1,4)
// B0D1<B0D15>
extern volatile __bit                   B0D15               __at(0x713D);	// @ (0xE27 * 8 + 5)
#define                                 B0D15_bit           _BIT_ACCESS(B0D1,5)
// B0D1<B0D16>
extern volatile __bit                   B0D16               __at(0x713E);	// @ (0xE27 * 8 + 6)
#define                                 B0D16_bit           _BIT_ACCESS(B0D1,6)
// B0D1<B0D17>
extern volatile __bit                   B0D17               __at(0x713F);	// @ (0xE27 * 8 + 7)
#define                                 B0D17_bit           _BIT_ACCESS(B0D1,7)
// B0D2<B0D20>
extern volatile __bit                   B0D20               __at(0x7140);	// @ (0xE28 * 8 + 0)
#define                                 B0D20_bit           _BIT_ACCESS(B0D2,0)
// B0D2<B0D21>
extern volatile __bit                   B0D21               __at(0x7141);	// @ (0xE28 * 8 + 1)
#define                                 B0D21_bit           _BIT_ACCESS(B0D2,1)
// B0D2<B0D22>
extern volatile __bit                   B0D22               __at(0x7142);	// @ (0xE28 * 8 + 2)
#define                                 B0D22_bit           _BIT_ACCESS(B0D2,2)
// B0D2<B0D23>
extern volatile __bit                   B0D23               __at(0x7143);	// @ (0xE28 * 8 + 3)
#define                                 B0D23_bit           _BIT_ACCESS(B0D2,3)
// B0D2<B0D24>
extern volatile __bit                   B0D24               __at(0x7144);	// @ (0xE28 * 8 + 4)
#define                                 B0D24_bit           _BIT_ACCESS(B0D2,4)
// B0D2<B0D25>
extern volatile __bit                   B0D25               __at(0x7145);	// @ (0xE28 * 8 + 5)
#define                                 B0D25_bit           _BIT_ACCESS(B0D2,5)
// B0D2<B0D26>
extern volatile __bit                   B0D26               __at(0x7146);	// @ (0xE28 * 8 + 6)
#define                                 B0D26_bit           _BIT_ACCESS(B0D2,6)
// B0D2<B0D27>
extern volatile __bit                   B0D27               __at(0x7147);	// @ (0xE28 * 8 + 7)
#define                                 B0D27_bit           _BIT_ACCESS(B0D2,7)
// B0D3<B0D30>
extern volatile __bit                   B0D30               __at(0x7148);	// @ (0xE29 * 8 + 0)
#define                                 B0D30_bit           _BIT_ACCESS(B0D3,0)
// B0D3<B0D31>
extern volatile __bit                   B0D31               __at(0x7149);	// @ (0xE29 * 8 + 1)
#define                                 B0D31_bit           _BIT_ACCESS(B0D3,1)
// B0D3<B0D32>
extern volatile __bit                   B0D32               __at(0x714A);	// @ (0xE29 * 8 + 2)
#define                                 B0D32_bit           _BIT_ACCESS(B0D3,2)
// B0D3<B0D33>
extern volatile __bit                   B0D33               __at(0x714B);	// @ (0xE29 * 8 + 3)
#define                                 B0D33_bit           _BIT_ACCESS(B0D3,3)
// B0D3<B0D34>
extern volatile __bit                   B0D34               __at(0x714C);	// @ (0xE29 * 8 + 4)
#define                                 B0D34_bit           _BIT_ACCESS(B0D3,4)
// B0D3<B0D35>
extern volatile __bit                   B0D35               __at(0x714D);	// @ (0xE29 * 8 + 5)
#define                                 B0D35_bit           _BIT_ACCESS(B0D3,5)
// B0D3<B0D36>
extern volatile __bit                   B0D36               __at(0x714E);	// @ (0xE29 * 8 + 6)
#define                                 B0D36_bit           _BIT_ACCESS(B0D3,6)
// B0D3<B0D37>
extern volatile __bit                   B0D37               __at(0x714F);	// @ (0xE29 * 8 + 7)
#define                                 B0D37_bit           _BIT_ACCESS(B0D3,7)
// B0D4<B0D40>
extern volatile __bit                   B0D40               __at(0x7150);	// @ (0xE2A * 8 + 0)
#define                                 B0D40_bit           _BIT_ACCESS(B0D4,0)
// B0D4<B0D41>
extern volatile __bit                   B0D41               __at(0x7151);	// @ (0xE2A * 8 + 1)
#define                                 B0D41_bit           _BIT_ACCESS(B0D4,1)
// B0D4<B0D42>
extern volatile __bit                   B0D42               __at(0x7152);	// @ (0xE2A * 8 + 2)
#define                                 B0D42_bit           _BIT_ACCESS(B0D4,2)
// B0D4<B0D43>
extern volatile __bit                   B0D43               __at(0x7153);	// @ (0xE2A * 8 + 3)
#define                                 B0D43_bit           _BIT_ACCESS(B0D4,3)
// B0D4<B0D44>
extern volatile __bit                   B0D44               __at(0x7154);	// @ (0xE2A * 8 + 4)
#define                                 B0D44_bit           _BIT_ACCESS(B0D4,4)
// B0D4<B0D45>
extern volatile __bit                   B0D45               __at(0x7155);	// @ (0xE2A * 8 + 5)
#define                                 B0D45_bit           _BIT_ACCESS(B0D4,5)
// B0D4<B0D46>
extern volatile __bit                   B0D46               __at(0x7156);	// @ (0xE2A * 8 + 6)
#define                                 B0D46_bit           _BIT_ACCESS(B0D4,6)
// B0D4<B0D47>
extern volatile __bit                   B0D47               __at(0x7157);	// @ (0xE2A * 8 + 7)
#define                                 B0D47_bit           _BIT_ACCESS(B0D4,7)
// B0D5<B0D50>
extern volatile __bit                   B0D50               __at(0x7158);	// @ (0xE2B * 8 + 0)
#define                                 B0D50_bit           _BIT_ACCESS(B0D5,0)
// B0D5<B0D51>
extern volatile __bit                   B0D51               __at(0x7159);	// @ (0xE2B * 8 + 1)
#define                                 B0D51_bit           _BIT_ACCESS(B0D5,1)
// B0D5<B0D52>
extern volatile __bit                   B0D52               __at(0x715A);	// @ (0xE2B * 8 + 2)
#define                                 B0D52_bit           _BIT_ACCESS(B0D5,2)
// B0D5<B0D53>
extern volatile __bit                   B0D53               __at(0x715B);	// @ (0xE2B * 8 + 3)
#define                                 B0D53_bit           _BIT_ACCESS(B0D5,3)
